package peaksoft;

/**
 * Hello world!
 *
 */
public class App 
{
    public static void main( String[] args ) {
//        Country->
//                бир мамлекетти сактоочу метод.
//                коп мамлекеттерди сактоочу метод.
//                баарын алуучу метод.
//        id си менен табуучу метод.
//                id си менен очуруучу метод.
//        баардык мамлекеттерди очуруп салуучу метод.
//                update();
//        description ны эн узун жазылган мамлекетти табуучу метод.
//        бир мамлекетти жазсак ал мамлекеттен канчоо экенин санын чыгарышы керек.
//        Address->
//                бир адрессти сактоочу метод.
//                коп адрессти сактоочу метод.
//                эскертуу -биз адрессти сактап жатканда мамлекетин кошо берип кетишибиз керек.
//        баарын алуучу метод.
//                id си менен табуучу метод.
//        id си менен очуруучу метод.
//                баардык адрессти очуруп салуучу метод.
//        update();
//        Programmer->
//                бир программистти сактоочу метод.
//                коп программистти сактоочу метод.
//                эскертуу -биз программистти сактап жатканда адресин кошо берип кетишибиз керек жана
//        программисттин email лы уникалный болсун бирок аны сиздер @Column(unique) колдонбонуздар жана
//        туулган жылына келе элек убакытты берсениз озунуз тузгон BadrequestExceptionнун ыргытсын
//        баарын алуучу метод.
//                id си менен табуучу метод.
//        id си менен очуруучу метод.
//                баардык программистти очуруп салуучу метод.
//        update();
//        мамлекетин жазсак ошол мамлекеттен болгон баардык программисттер чыксын.
//        эн жаш программистти жашын жана атын консолго чыгарыныз.
//        эн жашы чон программистти жашын жана атын консолго чыгарыныз.
//                Project->
//        бир проекти сактоочу метод.
//        коп проекти сактоочу метод.
//        баарын алуучу метод.
//                id си менен табуучу метод.
//        id си менен очуруучу метод.
//                баардык проекти очуруп салуучу метод.
//        update();
//        бир проектке програмистерди кошуучу метод болсун бирок бир проектте бир гана овнер болсун
//        эн кымбат проекти чыгарып бериниз
//        эн кыска убакытта жазылган проекти атын жана канча убакытта жазылганын чыгарып бериниз

        HibernateConnection.getEntityManager();








    }
}
